recorrido_test_api/app/controllers/servicios_controller.rb

  def index
    @servicios = Servicio.all
---
SELECT "servicios".* FROM "servicios"

  def create
    @servicio = Servicio.new(servicio_params)

    if @servicio.save
---
INSERT INTO "servicios" ("tipo_servicio", "created_at", "updated_at", "completed") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tipo_servicio", "comiida rapida"], ["created_at", "2022-04-05 22:31:36.140082"], ["updated_at", "2022-04-05 22:31:36.140082"], ["completed", nil]]

  def destroy
    @servicio.destroy
---
DELETE FROM "servicios" WHERE "servicios"."id" = $1  [["id", 1]]

    def set_servicio
      @servicio = Servicio.find(params[:id])
---
SELECT "servicios".* FROM "servicios" WHERE "servicios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]